Revit 2027 API
ExportDGNSettings.ListNames Method
 Returns a list of names of dgn export settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<string> ListNames(
	Document aDoc
)
Public Shared Function ListNames (
	aDoc As Document
) As IList(Of String)
public:
static IList<String^>^ ListNames(
	Document^ aDoc
)
static member ListNames :
        aDoc : Document -> IList<string>
Parameters
aDoc Document
 A Revit document to retrieve names from
Return Value
IList<String>
 An array of strings representing names of predefined setups.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportDGNSettings Class
Autodesk.Revit.DB Namespace